<template>
  <div class="px-[16px] pt-[15px]">
    <AsideMenuListSkeleton v-if="status == 'loading'" />
    <div v-if="status == 'success'">
      <AsideMenuListItem
        :selected="isReglamentsSelected"
        title="Регламенты"
        @click="gotoReglaments"
      >
        <svg
          width="22"
          height="22"
          viewBox="0 0 64 64"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M59.346 18.2667L45.746 4.66667C45.346 4.26667 44.746 4 44.146 4C43.546 4 42.946 4.26667 42.546 4.66667L35.546 11.6667C34.6793 12.5333 34.6793 14 35.546 14.8667L35.6126 14.9333L18.0793 23.6667C17.6126 23.9333 17.2126 24.3333 17.0126 24.8667L4.21263 56.8667C4.21263 56.9333 4.14597 57 4.14597 57.0667C4.0793 57.2 4.01263 57.3333 4.01263 57.4667C3.94597 58.0667 4.14597 58.6667 4.54597 59.1333C4.94597 59.7333 5.61263 60 6.2793 60C6.41263 60 6.54597 60 6.6793 59.9333C6.74597 59.9333 6.81263 59.9333 6.8793 59.8667C6.94597 59.8667 7.01263 59.8 7.0793 59.8L39.0793 47C39.6126 46.8 40.0126 46.4 40.2793 45.9333L49.0126 28.4L49.0793 28.4667C49.4793 28.8667 50.0793 29.1333 50.6793 29.1333C51.2793 29.1333 51.8793 28.8667 52.2793 28.4667L59.346 21.4667C60.2126 20.6 60.2126 19.1333 59.346 18.2667ZM27.746 35.3333C27.746 34.8 28.146 34.4 28.6793 34.4C29.2126 34.4 29.6126 34.8 29.6126 35.3333C29.6126 35.8667 29.2126 36.2667 28.6793 36.2667C28.146 36.2667 27.746 35.8 27.746 35.3333ZM15.6793 51.5333L26.746 40.4667C27.346 40.6667 28.0126 40.8 28.6793 40.8C31.6793 40.8 34.146 38.3333 34.146 35.3333C34.146 32.3333 31.6793 29.8667 28.6793 29.8667C25.6793 29.8667 23.2126 32.3333 23.2126 35.3333C23.2126 36 23.346 36.6667 23.546 37.2667L12.4793 48.3333L20.8793 27.3333L38.946 18.2667L45.6793 25L36.6793 43.1333L15.6793 51.5333ZM40.346 13.2667L44.146 9.46667L54.546 19.8667L50.746 23.6667L40.346 13.2667Z"
            fill="currentColor"
          />
        </svg>
      </AsideMenuListItem>
      <AsideMenuListItem
        :selected="isEmpsSelected"
        title="Сотрудники"
        @click="gotoEmps"
      >
        <svg
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M14.9998 6.54762C14.5894 6.54762 14.1957 6.71067 13.9055 7.00091C13.6153 7.29114 13.4522 7.68478 13.4522 8.09524C13.4522 8.50569 13.6153 8.89933 13.9055 9.18957C14.1957 9.4798 14.5894 9.64286 14.9998 9.64286C15.4103 9.64286 15.8039 9.4798 16.0942 9.18957C16.3844 8.89933 16.5475 8.50569 16.5475 8.09524C16.5475 7.68478 16.3844 7.29114 16.0942 7.00091C15.8039 6.71067 15.4103 6.54762 14.9998 6.54762ZM11.9046 8.09524C11.9046 7.27433 12.2307 6.48704 12.8112 5.90657C13.3916 5.3261 14.1789 5 14.9998 5C15.8207 5 16.608 5.3261 17.1885 5.90657C17.769 6.48704 18.0951 7.27433 18.0951 8.09524C18.0951 8.91615 17.769 9.70343 17.1885 10.2839C16.608 10.8644 15.8207 11.1905 14.9998 11.1905C14.1789 11.1905 13.3916 10.8644 12.8112 10.2839C12.2307 9.70343 11.9046 8.91615 11.9046 8.09524ZM22.351 7.32143C22.0432 7.32143 21.748 7.44372 21.5303 7.66139C21.3126 7.87907 21.1903 8.1743 21.1903 8.48214C21.1903 8.78998 21.3126 9.08522 21.5303 9.30289C21.748 9.52057 22.0432 9.64286 22.351 9.64286C22.6589 9.64286 22.9541 9.52057 23.1718 9.30289C23.3895 9.08522 23.5117 8.78998 23.5117 8.48214C23.5117 8.1743 23.3895 7.87907 23.1718 7.66139C22.9541 7.44372 22.6589 7.32143 22.351 7.32143ZM19.6427 8.48214C19.6427 8.12648 19.7127 7.7743 19.8489 7.44571C19.985 7.11712 20.1845 6.81855 20.4359 6.56706C20.6874 6.31557 20.986 6.11608 21.3146 5.97997C21.6432 5.84386 21.9954 5.77381 22.351 5.77381C22.7067 5.77381 23.0589 5.84386 23.3875 5.97997C23.7161 6.11608 24.0146 6.31557 24.2661 6.56706C24.5176 6.81855 24.7171 7.11712 24.8532 7.44571C24.9893 7.7743 25.0594 8.12648 25.0594 8.48214C25.0594 9.20044 24.774 9.88931 24.2661 10.3972C23.7582 10.9051 23.0693 11.1905 22.351 11.1905C21.6327 11.1905 20.9439 10.9051 20.4359 10.3972C19.928 9.88931 19.6427 9.20044 19.6427 8.48214ZM6.48793 8.48214C6.48793 8.1743 6.61022 7.87907 6.8279 7.66139C7.04557 7.44372 7.34081 7.32143 7.64865 7.32143C7.95649 7.32143 8.25172 7.44372 8.4694 7.66139C8.68707 7.87907 8.80936 8.1743 8.80936 8.48214C8.80936 8.78998 8.68707 9.08522 8.4694 9.30289C8.25172 9.52057 7.95649 9.64286 7.64865 9.64286C7.34081 9.64286 7.04557 9.52057 6.8279 9.30289C6.61022 9.08522 6.48793 8.78998 6.48793 8.48214ZM7.64865 5.77381C6.93035 5.77381 6.24148 6.05915 5.73357 6.56706C5.22566 7.07497 4.94031 7.76385 4.94031 8.48214C4.94031 9.20044 5.22566 9.88931 5.73357 10.3972C6.24148 10.9051 6.93035 11.1905 7.64865 11.1905C8.36694 11.1905 9.05582 10.9051 9.56373 10.3972C10.0716 9.88931 10.357 9.20044 10.357 8.48214C10.357 7.76385 10.0716 7.07497 9.56373 6.56706C9.05582 6.05915 8.36694 5.77381 7.64865 5.77381ZM9.31311 21.6408C8.96314 21.8714 8.55724 22.0031 8.1385 22.0217C7.71975 22.0402 7.30379 21.9451 6.93475 21.7463C6.56572 21.5476 6.25738 21.2526 6.04247 20.8927C5.82756 20.5329 5.7141 20.1215 5.71412 19.7024V14.6726C5.71412 14.57 5.75489 14.4716 5.82745 14.399C5.9 14.3265 5.99841 14.2857 6.10103 14.2857H9.22025C9.29083 13.7191 9.51748 13.1833 9.8749 12.7381H6.10103C5.58796 12.7381 5.09591 12.9419 4.73311 13.3047C4.37032 13.6675 4.1665 14.1596 4.1665 14.6726V19.7024C4.1663 20.3687 4.33818 21.0237 4.66549 21.6041C4.99279 22.1845 5.46443 22.6705 6.03472 23.0151C6.60501 23.3596 7.25461 23.5511 7.92062 23.5709C8.58663 23.5907 9.24646 23.4381 9.83621 23.128C9.59452 22.6586 9.41851 22.1582 9.31311 21.6408ZM20.1635 23.128C20.7532 23.4381 21.413 23.5907 22.0791 23.5709C22.7451 23.5511 23.3947 23.3596 23.965 23.0151C24.5352 22.6705 25.0069 22.1845 25.3342 21.6041C25.6615 21.0237 25.8334 20.3687 25.8332 19.7024V14.6726C25.8332 14.1596 25.6294 13.6675 25.2666 13.3047C24.9038 12.9419 24.4117 12.7381 23.8986 12.7381H20.1248C20.4819 13.1835 20.7085 13.7192 20.7794 14.2857H23.8986C24.0013 14.2857 24.0997 14.3265 24.1722 14.399C24.2448 14.4716 24.2856 14.57 24.2856 14.6726V19.7024C24.2856 20.1215 24.1721 20.5329 23.9572 20.8927C23.7423 21.2526 23.434 21.5476 23.0649 21.7463C22.6959 21.9451 22.2799 22.0402 21.8612 22.0217C21.4424 22.0031 21.0365 21.8714 20.6866 21.6408C20.5812 22.1581 20.4051 22.6586 20.1635 23.128ZM12.2915 12.7381C11.7784 12.7381 11.2864 12.9419 10.9236 13.3047C10.5608 13.6675 10.357 14.1596 10.357 14.6726V20.4762C10.357 21.7076 10.8461 22.8885 11.7168 23.7592C12.5875 24.6299 13.7685 25.119 14.9998 25.119C16.2312 25.119 17.4121 24.6299 18.2828 23.7592C19.1535 22.8885 19.6427 21.7076 19.6427 20.4762V14.6726C19.6427 14.1596 19.4389 13.6675 19.0761 13.3047C18.7133 12.9419 18.2212 12.7381 17.7082 12.7381H12.2915ZM11.9046 14.6726C11.9046 14.57 11.9454 14.4716 12.0179 14.399C12.0905 14.3265 12.1889 14.2857 12.2915 14.2857H17.7082C17.8108 14.2857 17.9092 14.3265 17.9818 14.399C18.0543 14.4716 18.0951 14.57 18.0951 14.6726V20.4762C18.0951 21.2971 17.769 22.0844 17.1885 22.6649C16.608 23.2453 15.8207 23.5714 14.9998 23.5714C14.1789 23.5714 13.3916 23.2453 12.8112 22.6649C12.2307 22.0844 11.9046 21.2971 11.9046 20.4762V14.6726Z"
            fill="currentColor"
          />
        </svg>
      </AsideMenuListItem>
      <AsideMenuListItem
        :selected="isTagsSelected"
        title="Метки"
        @click="gotoTags"
      >
        <svg
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M15.1314 7.73928C15.2871 7.57676 15.5025 7.48486 15.7276 7.48486L21.6895 7.48486C22.1456 7.48486 22.5153 7.85458 22.5153 8.31064V14.2726C22.5153 14.4977 22.4234 14.713 22.2609 14.8688L14.8658 21.9558C14.5414 22.2666 14.0281 22.2611 13.7105 21.9435L8.05667 16.2897C7.73902 15.972 7.73356 15.4587 8.04438 15.1344L15.1314 7.73928ZM14.1828 6.34215L6.29265 14.5753C5.67101 15.224 5.68193 16.2506 6.31723 16.8859L13.1143 23.6829C13.7496 24.3182 14.7762 24.3291 15.4248 23.7075L23.658 15.8174C23.983 15.5059 24.1668 15.0752 24.1668 14.625V7.48486C24.1668 6.57274 23.4274 5.83331 22.5153 5.83331H15.3752C14.925 5.83331 14.4943 6.0171 14.1828 6.34215ZM17.0535 11.0579C17.3059 10.8055 17.6406 10.6665 17.9979 10.6665C18.3553 10.6665 18.6899 10.8055 18.9424 11.0579C19.1948 11.3103 19.3337 11.645 19.3337 12.0023C19.3337 12.3597 19.1948 12.6943 18.9424 12.9467C18.6899 13.1992 18.3553 13.3381 17.9979 13.3381C17.6406 13.3381 17.3059 13.1992 17.0535 12.9467C16.8011 12.6943 16.6621 12.3597 16.6621 12.0023C16.6621 11.645 16.8011 11.3103 17.0535 11.0579Z"
            fill="currentColor"
          />
        </svg>
      </AsideMenuListItem>
      <!-- TODO: сделать где-нибудь единственный объект со всеми ссылками, чтобы было прямо константами
      по типу:
      const menu = {
        ...
        directory: [
          {
            name: 'Цвета',
            icon: '<название_svg>',
            to: '/colors'
          }
        ]
      }
      Это упростит добавление ссылок и управление ими. Там, где нужно динамически подгружать ссылки (например доски), можно оставить логику внутри компонента
      -->
      <!-- Пока что будут подсвечиваться обе вкладки (на самописном роутинге и vue-router). После полного перехода на vue-router всё нормально буджет -->
      <router-link
        v-slot="{ isActive }"
        to="/colors"
      >
        <AsideMenuListItem
          :selected="isActive"
          title="Цвета"
          @click="closeMenu"
        >
          <svg
            width="30"
            height="30"
            viewBox="0 0 30 30"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M24.6092 11.9041L23.6149 10.9103C23.278 10.5735 22.8029 10.452 22.3666 10.5569C22.4715 10.1153 22.35 9.64044 22.013 9.30918L19.8533 7.15045C19.6544 6.95169 19.4003 6.82471 19.1352 6.78054C19.091 6.51553 18.964 6.26156 18.7651 6.0628L18.0912 5.38923C17.572 4.87026 16.7324 4.87026 16.2187 5.38923L9.43554 12.1691C8.91631 12.6881 8.91631 13.5273 9.43554 14.0407L10.8828 15.4872C11.0208 15.6253 11.0816 15.8075 11.065 16.0007C11.0429 16.1884 10.938 16.3596 10.7778 16.4645C6.46931 19.2084 6.06608 19.6115 5.89484 19.7826C4.70172 20.9752 4.70172 22.913 5.89484 24.1056C7.08796 25.2981 9.02679 25.2981 10.2199 24.1056C10.3911 23.9344 10.7944 23.5314 13.5397 19.225C13.6446 19.0649 13.8103 18.96 14.0037 18.9379C14.197 18.9158 14.3848 18.9821 14.5174 19.1146L15.9646 20.5611C16.4838 21.0801 17.3234 21.0801 17.8371 20.5611L24.6202 13.7812C25.1284 13.2567 25.1284 12.4175 24.6092 11.9041ZM16.8926 19.617L15.4453 18.1705C15.0255 17.7509 14.44 17.5466 13.849 17.6128C13.258 17.6791 12.7332 18.0048 12.4128 18.5017C11.1976 20.412 9.66202 22.764 9.26983 23.156C8.59594 23.8295 7.49672 23.8295 6.82283 23.156C6.14893 22.4824 6.14893 21.3837 6.82283 20.7101C7.21501 20.3182 9.57364 18.7888 11.4793 17.5687C11.9765 17.2484 12.3079 16.7239 12.3742 16.1332C12.4404 15.5424 12.2305 14.9572 11.8163 14.5376L10.3691 13.0911L11.4241 12.0366L17.9421 18.5514L16.8926 19.617ZM18.8811 17.6294L12.3631 11.1146L17.1522 6.32781L17.8316 7.00138L17.0748 8.67978C17.0472 8.73499 17.0638 8.80676 17.108 8.85093C17.1522 8.8951 17.224 8.90614 17.2792 8.87854L18.9198 8.08903L21.0795 10.2478L19.0181 13.7328C18.9794 13.7935 18.9849 13.8708 19.0346 13.9205C19.0844 13.9702 19.1672 13.9812 19.228 13.9371L22.6814 11.8433L23.6757 12.8371L18.8811 17.6294Z"
              fill="currentColor"
            />
            <path
              d="M9.03784 21.7315C9.03784 22.1622 8.68984 22.51 8.25899 22.51C7.82814 22.51 7.48015 22.1622 7.48015 21.7315C7.48015 21.3009 7.82814 20.9531 8.25899 20.9531C8.68984 20.9531 9.03784 21.3009 9.03784 21.7315Z"
              fill="currentColor"
            />
          </svg>
        </AsideMenuListItem>
      </router-link>

      <router-link
        v-slot="{ isActive }"
        to="/notifications"
      >
        <AsideMenuListItem
          :selected="isActive"
          title="Уведомления"
          @click="closeMenu"
        >
          <svg
            width="22"
            height="22"
            viewBox="0 0 64 64"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M51.0055 4.66667H13.72C8.71681 4.66667 4.66663 8.7169 4.66663 13.7201V40.821C4.66663 45.8242 8.71681 49.8744 13.72 49.8744H46.6575L56.1278 59.3448C56.5447 59.7618 57.1404 60 57.736 60C58.9868 60 59.9993 58.9874 59.9993 57.7366V13.7201C60.0589 8.7169 56.0087 4.66667 51.0055 4.66667ZM9.25287 13.7201C9.25287 11.2185 11.278 9.25296 13.72 9.25296H51.0055C53.5071 9.25296 55.4726 11.2781 55.4726 13.7201V52.2569L49.2187 46.0029C48.8017 45.5859 48.2061 45.3477 47.6105 45.3477H13.72C11.2184 45.3477 9.25287 43.3226 9.25287 40.8805V13.7201Z"
              fill="currentColor"
            />
            <path
              d="M32.3627 31.291C34.5665 31.291 36.3534 29.5041 36.3534 27.3003C36.3534 25.0965 34.5665 23.3097 32.3627 23.3097C30.159 23.3097 28.3721 25.0965 28.3721 27.3003C28.3721 29.5041 30.159 31.291 32.3627 31.291Z"
              fill="currentColor"
            />
            <path
              d="M44.2155 31.291C46.4193 31.291 48.2061 29.5041 48.2061 27.3003C48.2061 25.0965 46.4193 23.3097 44.2155 23.3097C42.0117 23.3097 40.2249 25.0965 40.2249 27.3003C40.2249 29.5041 42.0117 31.291 44.2155 31.291Z"
              fill="currentColor"
            />
            <path
              d="M20.51 31.291C22.7138 31.291 24.5006 29.5041 24.5006 27.3003C24.5006 25.0965 22.7138 23.3097 20.51 23.3097C18.3062 23.3097 16.5194 25.0965 16.5194 27.3003C16.5194 29.5041 18.3062 31.291 20.51 31.291Z"
              fill="currentColor"
            />
          </svg>
        </AsideMenuListItem>
      </router-link>
    </div>
  </div>
</template>

<script>
import AsideMenuListSkeleton from '@/components/AsideMenu/AsideMenuListSkeleton.vue'
import AsideMenuListItem from '@/components/AsideMenu/AsideMenuListItem.vue'

export default {
  components: {
    AsideMenuListSkeleton,
    AsideMenuListItem
  },
  props: {
    menu: {
      type: Array,
      default: () => []
    }
  },
  computed: {
    status () {
      return this.$store.state.navigator.status
    },
    isAsideMobileExpanded () {
      return this.$store.state.isAsideMobileExpanded
    },
    isPropertiesMobileExpanded () {
      return this.$store.state.isPropertiesMobileExpanded
    },
    lastNavStack () {
      return this.$store.getters.lastNavStackElement
    },
    storeNavigator () {
      return this.$store.getters.sortedNavigator
    },
    isReglamentsSelected () {
      return this.lastNavStack?.greedPath === 'reglaments' ||
        this.lastNavStack?.global_property_uid === '92413f6c-2ef3-476e-9429-e76d7818685d'
    },
    isEmpsSelected () {
      return this.lastNavStack?.greedPath === 'new_emps'
    },
    isTagsSelected () {
      return this.lastNavStack?.greedPath === 'tags'
    },
    isColorsSelected () {
      return this.lastNavStack?.greedPath === 'colors'
    }
  },
  methods: {
    // Выношу логику по скрытию меню из selectSubMenuItem
    // TODO: Стоит перенести в MainMenu, а здесь просто делать emit
    closeMenu () {
      this.$store.state.navigator.submenu.status = false

      if (this.isPropertiesMobileExpanded) {
        this.$store.dispatch('asidePropertiesToggle', false)
      }
      if (this.isAsideMobileExpanded) {
        this.$store.dispatch('asideMobileToggle', false)
      }
    },
    selectSubMenuItem (isSelected, cbOpenView) {
      localStorage.setItem('lastTab', 'directory')
      //
      // REMOVE: Убрать после перехода на vue-router. Нужно для того, чтобы при переходе менялся url, соответственно компонент vue-router бы анмаунтился
      // Например без этой строки при урле '/colors', при переходе в другой раздел цвета всё равно остаются
      //
      this.$router.push('/directory')
      //
      // END REMOVE
      //
      // закрываем сабменю
      this.$store.state.navigator.submenu.status = false
      // если вкладка не поменялась - ничего не делаем
      if (isSelected) return
      // закрываем свойства
      if (this.isPropertiesMobileExpanded) {
        this.$store.dispatch('asidePropertiesToggle', false)
      }
      if (this.isAsideMobileExpanded) {
        this.$store.dispatch('asideMobileToggle', false)
      }
      cbOpenView()
    },
    gotoColors () {
      this.selectSubMenuItem(this.isColorsSelected, () => {
        // открываем вид
        this.$store.commit('basic', { key: 'mainSectionState', value: 'greed' })
        this.$store.commit('basic', { key: 'greedPath', value: 'colors' })
        const navElem = {
          name: 'Цвета',
          key: 'greedSource',
          greedPath: 'colors',
          value: this.storeNavigator.colors?.items
        }
        this.$store.commit('updateStackWithInitValue', navElem)
        this.$store.commit('basic', { key: 'greedSource', value: navElem.value })
      })
    },
    gotoTags () {
      this.selectSubMenuItem(this.isTagsSelected, () => {
        // открываем вид
        this.$store.commit('basic', { key: 'mainSectionState', value: 'greed' })
        this.$store.commit('basic', { key: 'greedPath', value: 'tags' })
        const navElem = {
          name: 'Метки',
          key: 'greedSource',
          greedPath: 'tags',
          value: this.storeNavigator.tags?.items
        }
        this.$store.commit('updateStackWithInitValue', navElem)
        this.$store.commit('basic', { key: 'greedSource', value: navElem.value })
      })
    },
    gotoEmps () {
      this.selectSubMenuItem(this.isEmpsSelected, () => {
        // открываем вид
        this.$store.commit('basic', { key: 'mainSectionState', value: 'greed' })
        this.$store.commit('basic', { key: 'greedPath', value: 'new_emps' })
        const navElem = {
          name: 'Сотрудники',
          key: 'greedSource',
          greedPath: 'new_emps',
          value: this.storeNavigator.new_emps
        }
        this.$store.commit('updateStackWithInitValue', navElem)
        this.$store.commit('basic', { key: 'greedSource', value: navElem.value })
      })
    },
    gotoReglaments () {
      this.selectSubMenuItem(this.isReglamentsSelected, () => {
        // открываем вид
        this.$store.commit('basic', { key: 'mainSectionState', value: 'greed' })
        this.$store.commit('basic', { key: 'greedPath', value: 'reglaments' })
        const navElem = {
          name: 'Регламенты',
          key: 'greedSource',
          greedPath: 'reglaments',
          value: this.storeNavigator.reglaments?.items
        }
        this.$store.commit('updateStackWithInitValue', navElem)
        this.$store.commit('basic', { key: 'greedSource', value: navElem.value })
      })
    }
  }
}
</script>
